1. Attendance Data
- Read the data from the attendance table and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
from pydataset import data

In [5]:
df = pd.read_csv('attendance.csv')
df

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [6]:
df.shape

(4, 9)

In [8]:
df_melt = df.melt(id_vars = 'Unnamed: 0',
                          var_name = 'day',
                        value_name = 'value')
df_melt

   Unnamed: 0         day value
0       Sally  2018-01-01     P
1        Jane  2018-01-01     A
2       Billy  2018-01-01     A
3        John  2018-01-01     P
4       Sally  2018-01-02     T
5        Jane  2018-01-02     P
6       Billy  2018-01-02     T
7        John  2018-01-02     T
8       Sally  2018-01-03     T
9        Jane  2018-01-03     T
10      Billy  2018-01-03     A
11       John  2018-01-03     H
12      Sally  2018-01-04     H
13       Jane  2018-01-04     T
14      Billy  2018-01-04     A
15       John  2018-01-04     P
16      Sally  2018-01-05     P
17       Jane  2018-01-05     T
18      Billy  2018-01-05     H
19       John  2018-01-05     P
20      Sally  2018-01-06     A
21       Jane  2018-01-06     T
22      Billy  2018-01-06     T
23       John  2018-01-06     T
24      Sally  2018-01-07     T
25       Jane  2018-01-07     A
26      Billy  2018-01-07     P
27       John  2018-01-07     P
28      Sally  2018-01-08     T
29       Jane  2018-01-08     T
30      Billy  2018-01-08     T
31       John  2018-01-08     P

In [18]:
df_melt['attendance_value'] = df_melt.value.map({'A':0, 'T':.9, 'P': 1, 'H':.5})
df_melt

   Unnamed: 0         day value  attendance_value
0       Sally  2018-01-01     P               1.0
1        Jane  2018-01-01     A               0.0
2       Billy  2018-01-01     A               0.0
3        John  2018-01-01     P               1.0
4       Sally  2018-01-02     T               0.9
5        Jane  2018-01-02     P               1.0
6       Billy  2018-01-02     T               0.9
7        John  2018-01-02     T               0.9
8       Sally  2018-01-03     T               0.9
9        Jane  2018-01-03     T               0.9
10      Billy  2018-01-03     A               0.0
11       John  2018-01-03     H               0.5
12      Sally  2018-01-04     H               0.5
13       Jane  2018-01-04     T               0.9
14      Billy  2018-01-04     A               0.0
15       John  2018-01-04     P               1.0
16      Sally  2018-01-05     P               1.0
17       Jane  2018-01-05     T               0.9
18      Billy  2018-01-05     H               0.5
19       John  2018-01-05     P               1.0
20      Sally  2018-01-06     A               0.0
21       Jane  2018-01-06     T               0.9
22      Billy  2018-01-06     T               0.9
23       John  2018-01-06     T               0.9
24      Sally  2018-01-07     T               0.9
25       Jane  2018-01-07     A               0.0
26      Billy  2018-01-07     P               1.0
27       John  2018-01-07     P               1.0
28      Sally  2018-01-08     T               0.9
29       Jane  2018-01-08     T               0.9
30      Billy  2018-01-08     T               0.9
31       John  2018-01-08     P               1.0

In [19]:
df_tidy = df_melt.groupby('Unnamed: 0').mean('attendance_value')
df_tidy

            attendance_value
Unnamed: 0
Billy                 0.5250
Jane                  0.6875
John                  0.9125
Sally                 0.7625

2. Coffee Levels
- Read the coffee_levels table.
- Transform the data so that each carafe is in it's own column.
- Is this the best shape for the data?

In [21]:
coffee = pd.read_csv('coffee_levels.csv')
coffee

    hour coffee_carafe  coffee_amount
0      8             x       0.816164
1      9             x       0.451018
2     10             x       0.843279
3     11             x       0.335533
4     12             x       0.898291
5     13             x       0.310711
6     14             x       0.507288
7     15             x       0.215043
8     16             x       0.183891
9     17             x       0.391560
10     8             y       0.189297
11     9             y       0.521502
12    10             y       0.023163
13    11             y       0.235529
14    12             y       0.017009
15    13             y       0.997464
16    14             y       0.058361
17    15             y       0.144644
18    16             y       0.544676
19    17             y       0.594126
20     8             z       0.999264
21     9             z       0.915990
22    10             z       0.144928
23    11             z       0.311495
24    12             z       0.771947
25    13             z       0.398520
26    14             z       0.864464
27    15             z       0.436364
28    16             z       0.280621
29    17             z       0.436677

In [25]:
coffee = coffee.pivot_table(index = 'hour',
                            columns = 'coffee_carafe',
                            values = 'coffee_amount')
coffee

coffee_carafe         x         y         z
hour
8              0.816164  0.189297  0.999264
9              0.451018  0.521502  0.915990
10             0.843279  0.023163  0.144928
11             0.335533  0.235529  0.311495
12             0.898291  0.017009  0.771947
13             0.310711  0.997464  0.398520
14             0.507288  0.058361  0.864464
15             0.215043  0.144644  0.436364
16             0.183891  0.544676  0.280621
17             0.391560  0.594126  0.436677

In [26]:
# I think the unpivoted table would be better because you can group by

3. Cake Recipes
- Read the cake_recipes table. This data set contains cake tastiness scores for combinations of different recipes, oven rack positions, and oven temperatures.
- Tidy the data as necessary.
- Which recipe, on average, is the best? recipe b
- Which oven temperature, on average, produces the best results? 275
- Which combination of recipe, rack position, and temperature gives the best result? recipe b, bottom rack, 300 degrees

In [30]:
data = pd.read_csv('cake_recipes.csv')
data

  recipe:position        225        250        275        300
0        a:bottom  61.738655  53.912627  74.414730  98.786784
1           a:top  51.709751  52.009735  68.576858  50.228470
2        b:bottom  57.095320  61.904369  61.196980  99.248541
3           b:top  82.455004  95.224151  98.594881  58.169349
4        c:bottom  96.470207  52.001358  92.893227  65.473084
5           c:top  71.306308  82.795477  92.098049  53.960273
6        d:bottom  52.799753  58.670419  51.747686  56.183110
7           d:top  96.873178  76.101363  59.571620  50.971626

In [33]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   recipe:position  8 non-null      object
 1   225              8 non-null      float64
 2   250              8 non-null      float64
 3   275              8 non-null      float64
 4   300              8 non-null      float64
dtypes: float64(4), object(1)
memory usage: 448.0+ bytes

In [37]:
data[['recipe', 'position']] = data['recipe:position'].str.split(':', expand = True)
data = data.drop(columns = ['recipe:position'])
data

         225        250        275        300 recipe position
0  61.738655  53.912627  74.414730  98.786784      a   bottom
1  51.709751  52.009735  68.576858  50.228470      a      top
2  57.095320  61.904369  61.196980  99.248541      b   bottom
3  82.455004  95.224151  98.594881  58.169349      b      top
4  96.470207  52.001358  92.893227  65.473084      c   bottom
5  71.306308  82.795477  92.098049  53.960273      c      top
6  52.799753  58.670419  51.747686  56.183110      d   bottom
7  96.873178  76.101363  59.571620  50.971626      d      top

In [38]:
data_melt = data.melt(id_vars = ['recipe', 'position'],
         var_name = 'temp',
         value_name = 'score')
data_melt

   recipe position temp      score
0       a   bottom  225  61.738655
1       a      top  225  51.709751
2       b   bottom  225  57.095320
3       b      top  225  82.455004
4       c   bottom  225  96.470207
5       c      top  225  71.306308
6       d   bottom  225  52.799753
7       d      top  225  96.873178
8       a   bottom  250  53.912627
9       a      top  250  52.009735
10      b   bottom  250  61.904369
11      b      top  250  95.224151
12      c   bottom  250  52.001358
13      c      top  250  82.795477
14      d   bottom  250  58.670419
15      d      top  250  76.101363
16      a   bottom  275  74.414730
17      a      top  275  68.576858
18      b   bottom  275  61.196980
19      b      top  275  98.594881
20      c   bottom  275  92.893227
21      c      top  275  92.098049
22      d   bottom  275  51.747686
23      d      top  275  59.571620
24      a   bottom  300  98.786784
25      a      top  300  50.228470
26      b   bottom  300  99.248541
27      b      top  300  58.169349
28      c   bottom  300  65.473084
29      c      top  300  53.960273
30      d   bottom  300  56.183110
31      d      top  300  50.971626

In [41]:
# Which recipe, on average, is the best? recipe b
data_melt.groupby('recipe').score.mean()

recipe
a    63.922201
b    76.736074
c    75.874748
d    62.864844
Name: score, dtype: float64

In [43]:
# Which oven temperature, on average, produces the best results? 275
data_melt.groupby('temp').score.mean()

temp
225    71.306022
250    66.577437
275    74.886754
300    66.627655
Name: score, dtype: float64

In [45]:
# Which combination of recipe, rack position, and temperature gives the best result? recipe b, bottom rack, 300 degrees
data_melt.sort_values(by='score').tail(1)

   recipe position temp      score
26      b   bottom  300  99.248541

4. Bonus: explore the other tables in the tidy_data database and reshape them as necessary so that they are in a tidy format.

In [48]:
gap = pd.read_csv('gapminder1.csv')
gap

      year      country    measure   measurement
0     1955  Afghanistan        pop  8.891209e+06
1     1960  Afghanistan        pop  9.829450e+06
2     1965  Afghanistan        pop  1.099788e+07
3     1970  Afghanistan        pop  1.243062e+07
4     1975  Afghanistan        pop  1.413202e+07
...    ...          ...        ...           ...
2074  1985    Venezuela  fertility  3.648500e+00
2075  1990    Venezuela  fertility  3.250000e+00
2076  1995    Venezuela  fertility  2.941500e+00
2077  2000    Venezuela  fertility  2.723000e+00
2078  2005    Venezuela  fertility  2.547000e+00

[2079 rows x 4 columns]

In [50]:
gap.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2079 entries, 0 to 2078
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   year         2079 non-null   int64
 1   country      2079 non-null   object
 2   measure      2079 non-null   object
 3   measurement  2079 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 65.1+ KB

In [52]:
gap_wide = gap.pivot_table(index=[ 'country','year'],
               columns = 'measure',
               values = 'measurement')
gap_wide

measure           fertility  life_expect         pop
country     year
Afghanistan 1955     7.7000       30.332   8891209.0
            1960     7.7000       31.997   9829450.0
            1965     7.7000       34.020  10997885.0
            1970     7.7000       36.088  12430623.0
            1975     7.7000       38.438  14132019.0
...                     ...          ...         ...
Venezuela   1985     3.6485       70.190  16997509.0
            1990     3.2500       71.150  19325222.0
            1995     2.9415       72.146  21555902.0
            2000     2.7230       72.766  23542649.0
            2005     2.5470       73.747  25375281.0

[693 rows x 3 columns]